sysbench_test_OpenGauss_Write_Intensive.log
========================================
Sysbench Test Parameters:
TABLES=10, TABLE_SIZE=1000000, THREADS=16, TIME=300, REPORT_INTERVAL=10
========================================
[1/3] Preparing data...
sysbench /usr/share/sysbench/oltp_read_write.lua --db-driver=pgsql --pgsql-host=172.17.0.2 --pgsql-port=5432 --pgsql-user=sbtest --pgsql-password=Opengauss@2022 --pgsql-db=sbtest --tables=10 --table-size=1000000 prepare
sysbench 1.0.11 (using system LuaJIT 2.1.0-beta3)

Creating table 'sbtest1'...
Inserting 1000000 records into 'sbtest1'
Creating a secondary index on 'sbtest1'...
Creating table 'sbtest2'...
Inserting 1000000 records into 'sbtest2'
Creating a secondary index on 'sbtest2'...
Creating table 'sbtest3'...
Inserting 1000000 records into 'sbtest3'
Creating a secondary index on 'sbtest3'...
Creating table 'sbtest4'...
Inserting 1000000 records into 'sbtest4'
Creating a secondary index on 'sbtest4'...
Creating table 'sbtest5'...
Inserting 1000000 records into 'sbtest5'
Creating a secondary index on 'sbtest5'...
Creating table 'sbtest6'...
Inserting 1000000 records into 'sbtest6'
Creating a secondary index on 'sbtest6'...
Creating table 'sbtest7'...
Inserting 1000000 records into 'sbtest7'
Creating a secondary index on 'sbtest7'...
Creating table 'sbtest8'...
Inserting 1000000 records into 'sbtest8'
Creating a secondary index on 'sbtest8'...
Creating table 'sbtest9'...
Inserting 1000000 records into 'sbtest9'
Creating a secondary index on 'sbtest9'...
Creating table 'sbtest10'...
Inserting 1000000 records into 'sbtest10'
Creating a secondary index on 'sbtest10'...
[2/3] Running benchmark...
sysbench /usr/share/sysbench/oltp_read_write.lua --db-driver=pgsql --pgsql-host=172.17.0.2 --pgsql-port=5432 --pgsql-user=sbtest --pgsql-password=Opengauss@2022 --pgsql-db=sbtest --tables=10 --table-size=1000000 --threads=16 --time=300 --report-interval=10 run
sysbench 1.0.11 (using system LuaJIT 2.1.0-beta3)

Running the test with following options:
Number of threads: 16
Report intermediate results every 10 second(s)
Initializing random number generator from current time


Initializing worker threads...

Threads started!

[ 10s ] thds: 16 tps: 414.56 qps: 8310.95 (r/w/o: 5821.20/1659.03/830.71) lat (ms,95%): 50.11 err/s: 0.00 reconn/s: 0.00
[ 20s ] thds: 16 tps: 385.51 qps: 7710.69 (r/w/o: 5396.93/1542.74/771.02) lat (ms,95%): 57.87 err/s: 0.00 reconn/s: 0.00
[ 30s ] thds: 16 tps: 347.90 qps: 6954.91 (r/w/o: 4868.21/1390.90/695.80) lat (ms,95%): 56.84 err/s: 0.00 reconn/s: 0.00
[ 40s ] thds: 16 tps: 340.60 qps: 6815.67 (r/w/o: 4772.28/1362.19/681.20) lat (ms,95%): 62.19 err/s: 0.00 reconn/s: 0.00
[ 50s ] thds: 16 tps: 296.90 qps: 5935.11 (r/w/o: 4153.61/1187.80/593.70) lat (ms,95%): 70.55 err/s: 0.00 reconn/s: 0.00
[ 60s ] thds: 16 tps: 276.80 qps: 5541.20 (r/w/o: 3879.80/1107.70/553.70) lat (ms,95%): 73.13 err/s: 0.00 reconn/s: 0.00
[ 70s ] thds: 16 tps: 251.20 qps: 5026.41 (r/w/o: 3517.61/1006.20/502.60) lat (ms,95%): 89.16 err/s: 0.10 reconn/s: 0.00
[ 80s ] thds: 16 tps: 264.80 qps: 5288.09 (r/w/o: 3701.79/1056.70/529.60) lat (ms,95%): 78.60 err/s: 0.00 reconn/s: 0.00
[ 90s ] thds: 16 tps: 277.30 qps: 5548.38 (r/w/o: 3883.89/1109.90/554.60) lat (ms,95%): 77.19 err/s: 0.00 reconn/s: 0.00
[ 100s ] thds: 16 tps: 244.00 qps: 4882.90 (r/w/o: 3418.43/976.48/487.99) lat (ms,95%): 84.47 err/s: 0.00 reconn/s: 0.00
[ 110s ] thds: 16 tps: 231.20 qps: 4624.66 (r/w/o: 3236.85/925.41/462.41) lat (ms,95%): 90.78 err/s: 0.00 reconn/s: 0.00
[ 120s ] thds: 16 tps: 239.10 qps: 4780.05 (r/w/o: 3347.24/954.61/478.21) lat (ms,95%): 92.42 err/s: 0.00 reconn/s: 0.00
[ 130s ] thds: 16 tps: 225.80 qps: 4516.38 (r/w/o: 3160.49/904.30/451.60) lat (ms,95%): 90.78 err/s: 0.00 reconn/s: 0.00
[ 140s ] thds: 16 tps: 225.00 qps: 4500.02 (r/w/o: 3149.71/900.30/450.00) lat (ms,95%): 104.84 err/s: 0.00 reconn/s: 0.00
[ 150s ] thds: 16 tps: 215.30 qps: 4305.30 (r/w/o: 3014.30/860.40/430.60) lat (ms,95%): 99.33 err/s: 0.00 reconn/s: 0.00
[ 160s ] thds: 16 tps: 220.50 qps: 4411.39 (r/w/o: 3087.69/882.70/441.00) lat (ms,95%): 101.13 err/s: 0.00 reconn/s: 0.00
[ 170s ] thds: 16 tps: 206.30 qps: 4124.80 (r/w/o: 2887.40/824.80/412.60) lat (ms,95%): 97.55 err/s: 0.00 reconn/s: 0.00
[ 180s ] thds: 16 tps: 219.80 qps: 4394.29 (r/w/o: 3075.99/878.70/439.60) lat (ms,95%): 99.33 err/s: 0.00 reconn/s: 0.00
[ 190s ] thds: 16 tps: 191.90 qps: 3840.72 (r/w/o: 2689.61/767.30/383.80) lat (ms,95%): 108.68 err/s: 0.00 reconn/s: 0.00
[ 200s ] thds: 16 tps: 196.80 qps: 3933.39 (r/w/o: 2752.40/787.40/393.60) lat (ms,95%): 110.66 err/s: 0.00 reconn/s: 0.00
[ 210s ] thds: 16 tps: 202.10 qps: 4043.47 (r/w/o: 2830.68/808.59/404.20) lat (ms,95%): 112.67 err/s: 0.00 reconn/s: 0.00
[ 220s ] thds: 16 tps: 201.20 qps: 4026.33 (r/w/o: 2818.62/805.11/402.60) lat (ms,95%): 110.66 err/s: 0.10 reconn/s: 0.00
[ 230s ] thds: 16 tps: 187.40 qps: 3748.60 (r/w/o: 2624.40/749.40/374.80) lat (ms,95%): 106.75 err/s: 0.00 reconn/s: 0.00
[ 240s ] thds: 16 tps: 206.50 qps: 4129.91 (r/w/o: 2890.91/826.00/413.00) lat (ms,95%): 104.84 err/s: 0.00 reconn/s: 0.00
[ 250s ] thds: 16 tps: 175.90 qps: 3518.39 (r/w/o: 2462.89/703.70/351.80) lat (ms,95%): 121.08 err/s: 0.00 reconn/s: 0.00
[ 260s ] thds: 16 tps: 184.00 qps: 3676.32 (r/w/o: 2572.81/735.50/368.00) lat (ms,95%): 123.28 err/s: 0.00 reconn/s: 0.00
[ 270s ] thds: 16 tps: 170.40 qps: 3412.50 (r/w/o: 2389.00/682.70/340.80) lat (ms,95%): 127.81 err/s: 0.00 reconn/s: 0.00
[ 280s ] thds: 16 tps: 189.70 qps: 3792.40 (r/w/o: 2655.10/757.90/379.40) lat (ms,95%): 121.08 err/s: 0.00 reconn/s: 0.00
[ 290s ] thds: 16 tps: 180.79 qps: 3616.91 (r/w/o: 2530.47/724.86/361.58) lat (ms,95%): 118.92 err/s: 0.00 reconn/s: 0.00
[ 300s ] thds: 16 tps: 167.71 qps: 3352.57 (r/w/o: 2347.72/669.43/335.42) lat (ms,95%): 125.52 err/s: 0.00 reconn/s: 0.00
SQL statistics:
    queries performed:
        read:                            999432
        write:                           285548
        other:                           142776
        total:                           1427756
    transactions:                        71386  (237.90 per sec.)
    queries:                             1427756 (4758.14 per sec.)
    ignored errors:                      2      (0.01 per sec.)
    reconnects:                          0      (0.00 per sec.)

General statistics:
    total time:                          300.0650s
    total number of events:              71386

Latency (ms):
         min:                                 12.83
         avg:                                 67.24
         max:                               1109.87
         95th percentile:                    102.97
         sum:                            4800291.24

Threads fairness:
    events (avg/stddev):           4461.6250/14.47
    execution time (avg/stddev):   300.0182/0.02

[3/3] Cleaning up...
sysbench /usr/share/sysbench/oltp_read_write.lua --db-driver=pgsql --pgsql-host=172.17.0.2 --pgsql-port=5432 --pgsql-user=sbtest --pgsql-password=Opengauss@2022 --pgsql-db=sbtest --tables=10 --table-size=1000000 cleanup
sysbench 1.0.11 (using system LuaJIT 2.1.0-beta3)

Dropping table 'sbtest1'...
Dropping table 'sbtest2'...
Dropping table 'sbtest3'...
Dropping table 'sbtest4'...
Dropping table 'sbtest5'...
Dropping table 'sbtest6'...
Dropping table 'sbtest7'...
Dropping table 'sbtest8'...
Dropping table 'sbtest9'...
Dropping table 'sbtest10'...
========================================
Sysbench full test completed. Results saved to sysbench_test_20241219_200051.log